Revit 2027 API
BuiltInFailures.RebarSystemFailures.ThinHostFloorError Property
 Rebar Cover Top and Bottom are too large for host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ThinHostFloorError { get; }
Public Shared ReadOnly Property ThinHostFloorError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ThinHostFloorError {
	FailureDefinitionId^ get ();
}
static member ThinHostFloorError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace